import pandas as pd

left, right = pd.DataFrame(), pd.DataFrame()

# ======================================================================================================================
# ********************************************* pd.merge()**************************************************************
# ======================================================================================================================
"""
merge：通过键拼接列
常用参数。
* how,值可以是inner,left,right,outer，默认值是inner
* left_on，right_on是用来指定希望用来作用合并依据的列名，如果不指定的话会自动寻找列名相同的列进行合并
* left_index，right_index设置为True的话表示使用该DF的列索引作为合并的根据进行合并
* sort默认为False，设置为True时表示合并时会根据给定的列值(也就是前面的left_on这种指定的列的值)来进行排序后再输出
* suffixes是用来给重名的列增加后缀名的，可以使用默认值也可以自己修改，比如要合并df1和df2都有一个列的名字是data,那么合并后left的DF的data列名变为了data_x
"""
pd.merge(left, right, on=None, left_on=None, right_on=None, left_index=False, right_index=False, suffixes=[],
         sort=False, validate=None)


# ======================================================================================================================
# ********************************************* pd.join()**************************************************************
# ======================================================================================================================
"""
join：主要用于索引上的合并
其参数的意义与merge方法中的参数意义基本一样。
"""

left.join(right, on=None, how='left', lsuffix='', rsuffix='', sort=False)


# ======================================================================================================================
# ********************************************* pd.concat()*************************************************************
# ======================================================================================================================
"""
concat：沿着一条轴，将多个对象堆叠到一起
常用的参数：
* objs:用来保存需要用来进行连接的Series/DataFrame，可以是列表或者dict类型
* axis表示希望进行连接的轴向，默认0，也就是纵向拼接
* join有多个选择，inner,outer,这里默认值是outer,下面会根据实例来比较下
* join_axes默认为空，可以设置值指定为其他轴上使用的索引
* ignore_index，连接后原来两个DF的index值会被保存，如果该索引没有实际的意义可以设置为True来进行重分配index号
"""
pd.concat([left, right], axis=0, join='outer', ignore_index=False, keys=None, levels=None, names=None, sort=False,
          copy=True, verify_integrity=False)